### Import packages

# There is something weird going on with my data

In [104]:
import sqlite3
import pandas as pd

### Connect to database

In [105]:
conn = sqlite3.connect('amazon_db.db')
c = conn.cursor()

In [106]:
c.execute("""SELECT * FROM books;""")

In [107]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head()

                                books num_copies
0         A Elephant Ate Under A Fish    4226324
1         A Boy Jumped Outside A Lake    4048899
2       One Man Hopped Under The Tree     774329
3  A Person Threw Behind The Notebook    1359606
4     The Tree Ran Through A Mountain    4703380

In [108]:
df.shape

(80000, 2)

### Use SQL to answer the following questions:

1.  How many rows are in the 'author' database? 

### There are 80000 rows###

2. How many authors are called David?  

### 1024 ###

In [109]:
c.execute("PRAGMA table_info(author)").fetchall()

[(0, 'author', 'TEXT', 0, None, 0), (1, 'book', 'TEXT', 0, None, 0)]

In [144]:
c.execute("PRAGMA table_info(author)").fetchall()

[(0, 'author', 'TEXT', 0, None, 0), (1, 'book', 'TEXT', 0, None, 0)]

In [110]:
c.execute("""SELECT * FROM author LIMIT 5;""").fetchall()

[('David Taylor', 'A Guy Dove Outside The Desk'),
 ('Sidney Osborne', 'A Fish Hopped Through A Lake'),
 ('Robert Martin', 'The Woman Winced Outside A Desk'),
 ('Greg Simpson', 'A Banana Winced Outside The Banana'),
 ('Edgar Williamson', 'A Person Ate Behind The Potato')]

In [111]:
df=pd.read_sql_query("""

SELECT * FROM author WHERE author LIKE "David%"

;""", con=conn)
df.describe()

             author                                  book
count          1335                                  1335
unique         1024                                  1335
top     David Smith  The Rabbit Punched Behind The Potato
freq             15                                     1

3. How many books each author wrote?

In [148]:
df=pd.read_sql_query("""

SELECT COUNT(*), book, author FROM author
GROUP BY author
;""", con=conn)
df.head()

   COUNT(*)                               book          author
0         1         A Lizard Jumped In A Salad    Aaron Agrela
1         1  One Frog Stole Outside The Banana     Aaron Allen
2         1    The Fish Threw Outside The Desk    Aaron Allman
3         1            A Dog Ate Through A Mug  Aaron Anderson
4         1   One Banana Jumped Under The Lake      Aaron Baez

#

4. Use both the author table and books table to 
say: how many copies were sold by authors named David 


    a. how many books for each of the Davids
    
    
    b. how many books in total for all Davids

In [121]:
c.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(c.fetchall())

[('books',), ('author',)]

In [122]:
c.execute("PRAGMA table_info(books)").fetchall()

[(0, 'books', 'TEXT', 0, None, 0), (1, 'num_copies', 'TEXT', 0, None, 0)]

In [124]:
c.execute("SELECT * FROM author LIMIT 10;")
print(c.fetchall())

[('David Taylor', 'A Guy Dove Outside The Desk'), ('Sidney Osborne', 'A Fish Hopped Through A Lake'), ('Robert Martin', 'The Woman Winced Outside A Desk'), ('Greg Simpson', 'A Banana Winced Outside The Banana'), ('Edgar Williamson', 'A Person Ate Behind The Potato'), ('Ethel Woods', 'A Cat Jumped On The Notebook'), ('Jonathan Munoz', 'The Worm Hopped Through A Banana'), ('Anthony Blache', 'The Fish Kicked Over The Tree'), ('Vanessa Rhodes', 'A Dog Threw Behind The Sky'), ('Paul Farish', 'One Person Threw On A River')]